Autodesk.Navisworks.Api.Data.DatabaseChangedEventArgs
Event arguments when a database changed event.

Autodesk.Navisworks.Api.Data.DatabaseChangedEventArgs.Action
Gets the action that caused the event

Autodesk.Navisworks.Api.Data.DatabaseChangedEventArgs.ActionType
Gets action type of database editing.

Autodesk.Navisworks.Api.Data.DatabaseChangedEventArgs.Changes
Gets change collection that were edited, if Action is not Edited, Changes will be null.